use Labstudy;

go
insert into Customers (cnum, cname, city, rating, snum)
values
(2001, 'Широбоков', 'Пермь', 100, 1001),
(2002, 'Андреев', 'Ижевск', 200, 1003),
(2003, 'Крымский', 'Москва', 200, 1002),
(2004, 'Ложкин', 'Брест', 300, 1002),
(2006, 'Попов', 'Минск', 100, 1001),
(2007, 'Бахин', 'Таллин', 100, 1004),
(2008, 'Елисеев', 'Ижевск', 300, 1007)

go
insert into Salespeople (snum, sname, city, comm)
values
(1001, 'Владик', 'Томск', 0.12),
(1002, 'Сергей', 'Самара', 0.31),
(1003, 'Петр', 'Клин', 0.1),
(1004, 'Игорь', 'Курск', 0.11),
(1007, 'Андрей', 'Ижевск', 0.15),
(1008, 'Виктор', 'Ижевск', 0.22),
(1009, 'Максим', 'Ижевск', 0.18)

go
insert into Orders (onum, amt, odate, cnum, snum)
values
(3001, 18.69, '23.10.90', 2008, 1007),
(3002, 1900.1, '23.09.90', 2007, 1004),
(3003, 767.19, '23.10.90', 2001, 1001),
(3005, 5160.45, '23.09.90', 2003, 1002),
(3006, 1098.16, '23.08.90', 2008, 1007),
(3007, 75.75, '24.09.90', 2004, 1002),
(3008, 4723, '25.10.90', 2006, 1001),
(3009, 1713.23, '24.07.90', 2002, 1003),
(3010, 1309.95, '26.07.90', 2004, 1002),
(3011, 9891.88, '26.10.90', 2006, 1001)
